{
  "navigation.link.skills": "SKILLS",
  "navigation.link.projects": "PROJECTS",
  "navigation.link.github": "GITHUB",
  "navigation.link.resume": "RESUME",
  "navigation.link.home": "HOME",
  "navigation.switch.language": "Przełącz na polski",
  "navigation.download.resume": "Download resume",

  "splash.hello.world": "Hello World",
  "splash.my.name": "My name is",
  "splash.socha": "Bartłomiej Socha",
  "splash.frontend.developer": "Frontend Developer",
  "splash.description": "I have knowledge about the tools and technologies used in the development of web applications, focusing especially on the front-end area. My skills include designing interfaces and developing applications in React and Angular environments. Thanks to the acquired knowledge and skills, I am able to create attractive, interactive interfaces tailored to the unique needs of users.",
  "splash.btn.contact": "CONTACT ME",

  "achivements.studies.title": "Studies",
  "achivements.studies.description": "Two completed fields of study where my passion for front-end development was born.",
  "achivements.projects.title": "Projects",
  "achivements.projects.description": "Numerous projects ranging from small websites to more comprehensive applications.",
  "achivements.courses.title": "Courses",
  "achivements.courses.description": "Several online courses that significantly deepened my knowledge in web development.",
  "achivements.technologies.title": "Technologies",
  "achivements.technologies.description": "Over twenty technologies and tools that I have learned, continuously improving my skills.",
  "achivements.internship.title": "Internship",
  "achivements.internship.description": "One year of internship and commercial experience that helped me grow into web development.",
  "achivements.experience.title": "Experience",
  "achivements.experience.description": "It has been over two years since I published my first application",

  "about.title": "About Me",
  "about.description": "I completed two different fields of study, earning the titles of Energy Engineer and Project Manager. My interest in programming and front-end technologies emerged during this time. After graduation, I deepened my knowledge in web development by taking numerous online courses and creating my own projects, which you can find in the projects section. Through this, I became familiar with various front-end technologies and gained the skills needed to create modern user interfaces. In my personal life, I place a strong emphasis on self-development and effective time management. I believe that efficiently managed time and consistency are the keys to continuous self-improvement.",
  "journey": {
    "title": "My Journey",
    "items": {
      "studies": {
        "title": "Studies",
        "description": "During my studies in the IT department, I created my first website, which sparked my passion for programming."
      },
      "courses": {
        "title": "Courses",
        "description": "Through intensive courses, I developed more advanced applications and deepened my knowledge of modern web technologies."
      },
      "projects": {
        "title": "Projects",
        "description": "Working on various projects allowed me to broaden my knowledge and apply new technologies and programming languages in practice."
      },
      "internship": {
        "title": "Internship",
        "description": "During a one-year internship, I gained my first commercial experience, which introduced me to teamwork on applications."
      }
    },
    "button": {
      "github": "GITHUB",
      "seeSkills": "Skills",
      "seeProjects": "Projects",
      "linkedin": "LinkedIn"
    }
  },
  "adventages": {
    "title": "Why Me",
    "items": {
      "responsiveness": {
        "title": "Responsiveness",
        "description": "Pages that adapt perfectly to different devices and screen sizes."
      },
      "uxUi": {
        "title": "UX/UI",
        "description": "Design with an emphasis on the user, ensuring intuitive and aesthetic user interfaces."
      },
      "libraries": {
        "title": "Libraries",
        "description": "Effective use of popular libraries for optimized project work."
      },
      "frameworks": {
        "title": "Frameworks",
        "description": "Ability to create dynamic applications using advanced frameworks."
      },
      "optimization": {
        "title": "Optimization",
        "description": "Page optimization for better performance and loading speed."
      },
      "creativity": {
        "title": "Creativity",
        "description": "A creative approach to solving problems and designing unique solutions."
      }
    },
    "button": {
      "github": "GitHub"
    }
  },

  "contact": {
    "title": "Contact Me",
    "header1": "Choose",
    "header2": "contact method",
    "snackbarMessage": "Please use LinkedIn to contact.",
    "items": {
      "instagram": {
        "name": "Instagram"
      },
      "linkedin": {
        "name": "LinkedIn"
      },
      "facebook": {
        "name": "Facebook"
      },
      "email": {
        "name": "Email"
      }
    }
  },

  "skills": {
    "skillsList": [
      {
        "id": 1,
        "name": "Core Web Development",
        "description": "Core Web Development skills are essential for creating modern and efficient web applications. Mastering these technologies enables building responsive, fast, and user-friendly websites."
      },
      {
        "id": 2,
        "name": "Libraries and Frameworks",
        "description": "Libraries and frameworks offer powerful tools and reusable components that accelerate development. They help create scalable and maintainable web applications efficiently."
      },
      {
        "id": 3,
        "name": "Tools and Technologies",
        "description": "Utilizing the right tools enhances productivity and collaboration during development. They assist in writing, testing, and deploying code efficiently while maintaining high quality."
      }
    ]
  },

  "projects": {
    "title": "My Projects",
    "hoverMessage": "Hover over a project to see its description",
    "see": "Details",
    "list": [
      {
        "title": "Calories Counter",
        "description": "This application is designed to help you calculate your caloric needs and track daily calorie intake. The app was built using Angular v17 with a less modern modular approach, mainly managing state via services and the RxJS library. Data is stored and retrieved in the cloud using Firebase's API."
      },
      {
        "title": "Progress Counter",
        "description": "This app allows you to analyze your strength progress. It lets you set up individual workouts, add exercises, and analyze charts related to your achievements. The app was built using Angular v17 with a modern approach, utilizing standalone components and signals. State management is handled by NgRx Signal Store, and data is stored and retrieved in the cloud using Firebase's API."
      },
      {
        "title": "Portfolio",
        "description": "A portfolio website containing the key information that highlights me as a Front-End Developer and encourages others to collaborate with me. The site is built using React, with Redux used for state management. Material UI was used for faster development of certain components. The app does not interact with a backend."
      }
    ]
  }
}
